#سازنده araz
import tkinter #استفاده از tkinter
import turtle  #استفاده از turtle
laki=turtle.Turtle() #ساخت متغیر برای کشیدن خط
win=tkinter.Tk()  #ساخت متغیر برای ساخت صفحه
#-------------------------------------------------
def y(): #تابع y برای حرکت به چپ
    

    laki.left(90)  

    turtle.mainloop()
#-------------------------------------------------
def stert(): #برای کشیدن خط 
    
    laki.forward(90)

    turtle.mainloop()
#-------------------------------------------------
def x(): #برای حرکت به راست 
    
    laki.right(90)

    turtle.mainloop()
#-------------------------------------------------
def circle():  # برای رسم دایره 
    laki.circle(60)

    turtle.mainloop()
#-------------------------------------------------
def home():  # بازگشت به جای اولیه
    laki.penup()
    laki.goto(0,0)
    laki.pendown()
#-------------------------------------------------

def clear():  #تمیز کردن صفحه
    laki.clear()
#-------------------------------------------------
win.geometry("400x400") # اندازه صفحه
#-------------------------------------------------
tkinter.Button(text="y",command=y).pack() # ساخت دکمه حرکت به چپ
#-------------------------------------------------
tkinter.Button(text="start",command=stert).pack()  #ساخت دکمه برای خط کشیدن
#-------------------------------------------------
tkinter.Button(text="x",command=x).pack()  # ساخت دکمه برای حرکت به راست
#-------------------------------------------------
tkinter.Button(text="circle",command=circle).pack()  # ساخت دکمه برای رسم دایره
#-------------------------------------------------
tkinter.Button(text="home",command=home).pack()  #ساخت دکمه برای بازگشت به جای اولیه
#-------------------------------------------------
tkinter.Button(text="claer",command=clear).pack()  # ساخت دکمه برای تمیز کردن صفحه
#-------------------------------------------------
tkinter.mainloop()
